app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "created_at", "updated_at") VALUES ('test', '2024-12-22 07:43:29.990923', '2024-12-22 07:43:29.990923') RETURNING "id"

  def update
    #@product = Product.find(params[:id])
    if @product.update(product_params)
---
UPDATE "products" SET "name" = 'new Cap3333', "updated_at" = '2024-12-22 06:14:54.255027' WHERE "products"."id" = 2